---
title: Идентификаторы закупок и контрактов (ЕИС)
sidebar_label: Идентификаторы ЕИС
tags:
  - howto
  - analysis
  - procurement
last_updated: 2026-05-12T00:00:00.000Z
content_type: howto
entity_type: howto
description: >-
  Различение извещения, процедуры и контракта; реестровый номер и версии в XML
  ЕИС; отбор 44-ФЗ и 223-ФЗ; связка с гражданскими API (Clearspending) без
  подмены официальной схемы.
related_pages:
  - /data-sources/federal/procurement
  - /data-sources/federal/zakupki-xml
  - /information-systems/federal/zakupki
  - /glossary/procurement-44fz
  - /glossary/procurement-223fz
  - /howto/access/clearspending
  - /howto/analysis/tax-org-identifiers-decoding
  - /reporting/procurement-contract-reporting
---

# Идентификаторы закупок и контрактов (ЕИС)

## Зачем и для кого

Инструкция для **аналитиков и разработчиков**, которые собирают **собственный регистр** из [XML-выгрузок ЕИС](/data-sources/federal/zakupki-xml), стыкуют витрину с [Clearspending](/howto/access/clearspending) или разбирают **колонки идентификаторов** в CSV. Здесь — **логика сущностей и ключей**; **точные имена XML-элементов и строковые форматы** задаются **актуальными XSD и методичкой** на [портале ЕИС](https://zakupki.gov.ru/epz/main/public/document/view.html) и меняются вместе с регламентом оператора.

## Входные данные

- **Поток документов** — извещения, протоколы, контракты, планы-графики (перечень типов — в [сведениях о закупках](/data-sources/federal/procurement)).
- **Поля идентификаторов** из выбранной схемы XML или экспорта: как минимум различите **идентификатор закупки / извещения / процедуры** и **идентификатор контракта** (в т.ч. **реестровый номер контракта** в смысле витрины ЕИС).
- **Признак правового режима** — [44-ФЗ](/glossary/procurement-44fz) vs [223-ФЗ](/glossary/procurement-223fz); в смешанных архивах без отбора агрегаты искажаются.

## Инструменты

- Документация и **XSD** на `zakupki.gov.ru` (см. [XML-выгрузки](/data-sources/federal/zakupki-xml)).
- **XML-парсер** (Python `lxml`, `xml.etree` и т.д.) или **SQL** после загрузки в таблицы.
- Для точечных проверок без сборки архивов — [REST API Clearspending](/howto/access/clearspending) с параметром **`regnum`** (не официальный дубль ЕИС, удобен для валидации).

## Шаги

1. **Зафиксируйте правовой режим** по полям схемы или пути файла (**44** / **223**); отфильтруйте поток **до** склейки таблиц.
2. **Постройте модель связей:** извещение и протоколы относятся к **процедуре закупки**; **контракт** подписывается по результатам процедуры — в XML связь выражена ссылками и общими идентификаторами в логике **той версии схемы**, которую вы парсите (сверьте с XSD).
3. **Реестровый номер контракта** используйте как **стабильный публичный ключ** контракта на витрине **в паре с версией документа**, если схема предусматривает версионирование — иначе при обновлении карточки возможны **дубликаты** или «расхлопывание» одного договора.
4. **Не смешивайте** внутренние идентификаторы веб-карточки (например, параметры `contractInfoId` в URL портала) с **реестровым номером** без проверки по XSD/выгрузке: для интеграций опирайтесь на **поля XML**, а не на устойчивость формата URL.
5. **Стыковка с бюджетом** — по **[КБК](/glossary/kbk)**, [ИНН](/glossary/inn), [КПП](/glossary/kpp) и иным полям **если они есть** в конкретном типе документа; отсутствие КБК в XML не заполняется «из головы».
6. Для **организаций** нормализуйте реквизиты по [ИНН, КПП, ОГРН](/howto/analysis/tax-org-identifiers-decoding).

## Воспроизводимый пример

Извлечь **query-параметры** из URL карточки на портале (удобно для ручной трассировки; **не** замена полям XML):

```python
from urllib.parse import parse_qs, urlparse


def url_query_keys(url: str) -> dict[str, list[str]]:
    return parse_qs(urlparse(url.strip()).query)


# Подставьте URL из адресной строки браузера — имена параметров меняются между разделами портала
sample = "https://zakupki.gov.ru/epz/contract/contractCard/common-info.html?contractInfoId=1234567890"
print(url_query_keys(sample))
# {'contractInfoId': ['1234567890']}
```

Запрос **одного контракта** через публичный API Clearspending по **`regnum`** (тот же идентификатор, что в примере [how-to Clearspending](/howto/access/clearspending); подставьте актуальный номер из своей выборки):

```bash
curl -sS -G "https://openapi.clearspending.ru/restapi/v3/contracts/get/" \
  --data-urlencode "regnum=0173100000414000011" \
  -H "User-Agent: Mozilla/5.0 (compatible; eis-id-check/1.0)" | head -c 500
```

## Проверка результата

- После сборки регистра контрактов **нет** неожиданных дубликатов одного реестрового номера с разными суммами без объяснения версий или исправлений.
- Доля документов **без известного ключа связи** к процедуре согласована с ожидаемыми типами файлов в архиве (часть сведений публикуется отдельными комплектами).
- Выборки по **44-ФЗ** и **223-ФЗ** не смешаны в одном отчёте без явной метки режима.

## Ограничения и типовые ошибки

- **Один реестровый номер** в гражданском API и в XML должен совпадать по смыслу, но **юридически значимая** редакция документа — на [ЕИС](/information-systems/federal/zakupki); зеркала могут отставать.
- **Игнорирование 223-ФЗ** в общем потоке — завышение объёмов «госзакупок» в смысле 44-ФЗ.
- **Путаница ОГРН организации** с номером контракта или внутренним `uuid` в стороннем API — разные пространства идентификаторов.
- Жёсткая привязка кладки **URL портала** в продакшен-пайплайне — ломается при смене маршрутов; для массовой обработки используйте **официальные XML/СОИ** (см. [карточку ЕИС](/information-systems/federal/zakupki)).

## Связанные страницы

- [Сведения о закупках и контрактах (ЕИС)](/data-sources/federal/procurement) — концептуальный вход и смешение 44/223.
- [XML-выгрузки ЕИС](/data-sources/federal/zakupki-xml) — сырые комплекты и типичные ключи связи.
- [ЕИС в сфере закупок](/information-systems/federal/zakupki) — оператор, СОИ, ограничения.
- [44-ФЗ](/glossary/procurement-44fz) и [223-ФЗ](/glossary/procurement-223fz) — правовые границы выборок.
- [REST API Clearspending](/howto/access/clearspending) — параметр `regnum` и поиск по ИНН.
- [ИНН, КПП, ОГРН и ОКТМО в выгрузках](/howto/analysis/tax-org-identifiers-decoding) — нормализация сторон контракта.
- [Отчётность по контрактам](/reporting/procurement-contract-reporting) — формы, смежные с реестрами.
- [Расшифровка КБК](/howto/analysis/kbc-decoding) — если в контракте или плане есть поле КБК.
